---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadWidthInsideBoundary
source: html/b1870146-897e-b4a4-e4e8-579c89102ae3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeMinimumTreadWidthInsideBoundary Property

"Min. Tread Depth on Winder Inner Boundary": Minimum Tread Width on Inside Boundary

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeMinimumTreadWidthInsideBoundary { get; }
```